__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input (InputLayer)              (None, 1, 22, 48)    0                                            
__________________________________________________________________________________________________
3h_conv (Conv2D)                (None, 1, 22, 16)    2320        input[0][0]                      
__________________________________________________________________________________________________
6h_conv (Conv2D)                (None, 1, 22, 16)    4624        input[0][0]                      
__________________________________________________________________________________________________
12h_conv (Conv2D)               (None, 1, 22, 16)    9232        input[0][0]                      
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 1, 22, 16)    0           3h_conv[0][0]                    
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 1, 22, 16)    0           6h_conv[0][0]                    
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 1, 22, 16)    0           12h_conv[0][0]                   
__________________________________________________________________________________________________
3h_pooled (AveragePooling2D)    (None, 1, 8, 16)     0           activation_13[0][0]              
__________________________________________________________________________________________________
6h_pooled (AveragePooling2D)    (None, 1, 8, 16)     0           activation_14[0][0]              
__________________________________________________________________________________________________
12h_pooled (AveragePooling2D)   (None, 1, 8, 16)     0           activation_15[0][0]              
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 1, 8, 48)     0           3h_pooled[0][0]                  
                                                                 6h_pooled[0][0]                  
                                                                 12h_pooled[0][0]                 
__________________________________________________________________________________________________
dropout1 (Dropout)              (None, 1, 8, 48)     0           concatenate_5[0][0]              
__________________________________________________________________________________________________
bn1 (BatchNormalization)        (None, 1, 8, 48)     192         dropout1[0][0]                   
__________________________________________________________________________________________________
flatten_5 (Flatten)             (None, 384)          0           bn1[0][0]                        
__________________________________________________________________________________________________
fc1 (Dense)                     (None, 256)          98560       flatten_5[0][0]                  
__________________________________________________________________________________________________
dropout3 (Dropout)              (None, 256)          0           fc1[0][0]                        
__________________________________________________________________________________________________
bn3 (BatchNormalization)        (None, 256)          1024        dropout3[0][0]                   
__________________________________________________________________________________________________
fc2 (Dense)                     (None, 1)            257         bn3[0][0]                        
==================================================================================================
Total params: 116,209
Trainable params: 115,601
Non-trainable params: 608
__________________________________________________________________________________________________
